app/controllers/festivals_controller.rb

  def index
    @festivals = Festival.all
---
SELECT "festivals".* FROM "festivals"

  def show
    @festival = Festival.find(festival_id)
---
SELECT  "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @festival = Festival.new(festival_params)
    if @festival.save
---
INSERT INTO "festivals" ("name", "location", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "3qwe"], ["location", "test`"], ["image_url", "qweq"], ["created_at", 2016-10-25 17:35:42 UTC], ["updated_at", 2016-10-25 17:35:42 UTC]]

  def edit
    @festival = Festival.find(festival_id)
---
SELECT  "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

  def update
    @festival = Festival.find(festival_id)
    @festival.update_attributes(festival_params)
---
SELECT  "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "festivals" SET "name" = $1, "location" = $2, "start_date" = $3, "end_date" = $4, "image_url" = $5, "updated_at" = $6 WHERE "festivals"."id" = $7

  def destroy
    festival = Festival.find(festival_id)
    festival.delete
---
SELECT  "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
DELETE FROM "festivals" WHERE "festivals"."id" = $1  [["id", 37]]